import firebase from "firebase";

const firebaseApp = firebase.initializeApp({
  apiKey: "AIzaSyDtcUDCA4pU8F1dLv9m4ZP9qBoKg6O2gfc",
  authDomain: "myanmar-proverbs.firebaseapp.com",
  databaseURL: "https://myanmar-proverbs.firebaseio.com",
  projectId: "myanmar-proverbs",
  storageBucket: "myanmar-proverbs.appspot.com",
  messagingSenderId: "750301861530",
  appId: "1:750301861530:web:29bd1f1b1d8547acd37123"
});

const db = firebaseApp.firestore();

export { db };

const menu = [
  {
    "short": "မပြည့်တဲ့မိုး ဘောင်ဘင်ခတ်",
    "long": "-",
    "creator": "ဗမာ"
  },
  {
    "short": "မိုးထိအောင် လှေကားထောင်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မိန်းမတို့အိန္ဒြေ..ရွှေပေးလို့မရ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "‌မေးပါများ..စကားရ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မအိပ်မနေ..အသက်ရှည်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မြွေမသေ တုတ်မကျိုး",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မျက်နှာသာပေး ရွှေရေးပန်းကန်တက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မသိလျှင်မေး...မစင်လျှင်ဆေး",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မ..ဘက်လိုက်တော့...မိုက်ဘက်ပါ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မောင်တစ်ထမ်း....မယ်တစ်ရွက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မြင်းကမလှုပ်...ခုံကလှုပ်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မစားရတဲ့အမဲ..သဲနဲ့ပက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မယားနေစ...ကြောင်သေမှ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မီးများမီးနိုင်...ရေများရေနိုင်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မချစ်သော်လည်း...အောင့်ကာနမ်း",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မြေနိမ့်ရာ...လှံစိုက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မိုးရွာတုန်း...ရေခံ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မျက်နှာကြီးရာ..ဟင်းဖတ်ပါ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မသိသူကျော်စား...သိသူဖော်စား",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မြွေမြွေချင်း..ခြေမြင်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မူးကို.မြစ်ထင်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မျက်ကန်း..တစ္ဆေမကြောက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မယားဆို..ပျိုမှ..သမားဆို..အိုမှ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မမှားသောရှေ့နေ...မသေသောဆေးသမား..မရှိ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မျက်ဖြူစိုက်လေ...ဆရာကြိုက်လေ.",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မလို...ကူးတို့ခတောင်း",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မင်းနားတစ်ထောင်..မင်းမြှောက်တစ်သိန်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မျောက်ပြ..ဆန်တောင်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မကတတ်သော်....ဖျာကိုအပြစ်တင်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မြွေပါလည်းဆုံး...သားလည်းဆုံး",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မည်းမည်းမြင်ရာ...ငါ့ယောက္ခမထန်းတောမလုပ်ချင်နဲ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မီးစတစ်မှုတ်...ရေတစ်မှုတ်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မီးဝေး...ချိတ်မာ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မြွေမကြောက်....ကင်းမကြောက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "မောင်မောင်ဆိုလေ....ထီးရိုးရှည်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ယုန်တောင်ပြေး..ခွေးမြောက်လိုက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ယုန်ကမတိုး..ပိုက်ကတို",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ယင်ကောင်မြင်တိုင်း..လေယာဉ်မထင်နဲ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရည်းစားလူလု..အူနုကျွဲခတ်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရလေလိုလေ..အိုတစ္ဆေ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရလေလိုလေ..အိုတစ္ဆေ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရတာမလို..လိုတာမရ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရည်းစားတစ်ထောင်..လင်ကောင်းတစ်ယောက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရာသီမသိ...ပန်းနဲ့ညှိ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရရစားစား..ဝါးဝါးမြိုမြို",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရှိတန်ဆာ...မရှိဝမ်းစာ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရှိလျှင်တန်ဆာ၊ မရှိလျှင်ဝမ်းစာ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရွှေအကြောင်း..ဖယောင်းသက်သေ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရှဉ့်လည်းလျှောက်သာ..ပျားလည်းစွဲသာ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရွာနားကမြက်...ရွာနွားမစား",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရာဇဝတ်အိုး...တုတ်နဲ့ထို",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရှမ်းကြိုက်ရင်..နွားချေ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရတနာရှိရာ..ရတနာလာ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရသာများ၍.ငါးမတွေ့",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရှေ့နေငှားမှ...ထောင်လုံးလုံးကျ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရှေးထုံးလည်းမပယ်နဲ့...ဈေးသုံးလည်းမကြွယ်နဲ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရေကြည်ရာ..မြက်နုရာ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရှာဖွေလေ..တွေ့ရှိလေ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရန်သူပြန်မှ..ဒူးလေးပြင်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရှားပင်အိုလေ...အနှစ်ပြည့်လေ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရယ်သောသူ...အသက်ရှည်၏",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရာဇဝတ်ဘေး..ပြေးမလွတ်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရေများရေနိုင်..မီးများမီးနိုင်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရန်ကိုရန်ချင်း..မတုံ့နှင်းနှင့်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရှင်နည်းရာ..အဂ္ဂလူထွက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရှာင်လေဝေးဝေး..မူးယစ်ဆေး",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရေစီးတစ်ခါ....ရေသာတစ်လှည့်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရှင်ဘုရင်တစ်ခါထွက်...ပဲကြီးတစ်လှေချက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရေမနောက်.....ကြာမရှောက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ရွှေပင်နားတော့....ရွှေကျေး",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြက်ကန်း ဆန်အိုးတိုး",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကိုင်းကျွန်းမှီ ကျွန်းကိုင်းမှီ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကိုယ်ကကျူး ကိုယ့်ဒူးတောင်မယုံရ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကိုယ်ထင် ကုတင်ရွှေနန်း",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကျွဲပါး စောင်းတီး",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကတုံးပေါ် ထိပ်ကွက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကျေးဇူးရှိမှ ကျေးစွပ်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြမ်းကျွံရင် နှုတ်ရ..စကားကျွံရင် နှုတ်မရ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကျန်းမာခြင်းသည်..လာဘ်တစ်ပါး",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြက်တူရွေးကတော်တော်...မယ်ဘော်က..ကဲ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကျူပင်ခုတ်..ကျူငုတ်ပါမကျန်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကျားဆရာကြောင်...ကြောင်ဆရာကြွက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြွက်မနိုင်..ကျီမီးနဲ့ရှို့",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကျီစားသန်က..ရန်များ၏",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "က ရိုး မက ဆန်း၍က နှပ်ပစ်ခံရ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကျားကြောက်လို့...ရှင်ကြီးကိုး..ရှင်ကြီး.ကျားထက်ဆိုး",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကံကိုယုံတော့..စုံလုံးကန်း",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကျော်တော့..လှေသူကြီး...ညားတော့..လှေထိုးသား",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကံကိုယုံပြီး...ဆူးပုံနင်း",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကျားရှေ့...မှောက်ရက်လဲ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြာကြာဝါးမှ..ခါးမှန်းသိ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြာကြာဝါးမယ့်သွား...အရိုးကြည့်ရှောင်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကျားကြီး..ခြေရာကြီး”",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကံဆိုးမသွားရာ...မိုးလိုက်လို့ရွာ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြွေတစ်လှည့်...ကြက်တစ်ခုန်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြောင်သူတော်..ကြွက်သူခိုး",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကျောသားကလည်းသား...ရင်သားကလည်းသား",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြွက်သေတစ်ခု....အရင်းပြု",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကုသိုလ်တစ်ပဲ...ငရဲတစ်ပိဿာ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကုလားမနိုင်....ရခိုင်မဲ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြောက်ရင်လာဘ်လွဲ...ရဲလျှင်မင်းဖြစ်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကွန်တစ်ချက်....ဟင်းတစ်ခွက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြောင်အိုတော့...ကြွက်မလေး",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြိုက်မရှက်...ငိုက်မရှက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကျင်ကြီးစွန့်ရာ...ကျင်ငယ်ပါ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြောင်ကဲ့သို့.ကျင့်လေ..ညောင်ကဲ့သို့..ကျင့်လေ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကောက်သော်..စားမလောက်...ဖြောင့်သော်..စားမနိုင်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကိုယ်ကောင်းရင်..ခေါင်းမရွေ့",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကချင်ရက်...လက်ကျိုး",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကံသာလျှင်အမိ..ကံသာလျှင်အဖ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကျည်ပွေ့ကောင်းလို့..ဆန်ဖြူ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကင်းခြေများ.ခြေတစ်ချောင်းကျိုး၍..အသွားမပျက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကျားရဲလည်းသေ...တောလည်းကျေ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြက်မ.တွန်လို့..မိုးမလင်း",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကိုယ့်ဂုဏ်ကိုယ်ဖော်..မသူတော်ခုနစ်ပါး",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကွမ်းသီးကြိုက်...တောင်ငူပို့",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကိုယ့်ဒူး..ကိုယ်ချွန်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြီးလျှင်မှီ..ငယ်လျှင်ချီ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကဆုန်.နယုန်..စွေ့စွေ့ခုန်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကျေးဇူးမတင်…ဖင်လှန်ပြ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြပ်ပူထိုးလေ ရောင်လေ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြက်မတွန်၍ မိုးမလင်း၊ ကြက်ဖတွန်မှ မိုးလင်းသည်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကိုယ်ဖြစ်.ကိုယ်ခံ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကုလားသိုက်...ကျားဝင်ကိုက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကျီးကြည့်...ကြောင်ကြည့်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြက်ကြော်မကြိုက်တဲ့....လူမိုက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြောင်မရှိ....ကြွက်ထ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကလေးကျမှ.လှေခါးထောင်....ရန်သူပြန်မှ..ဒူးလေးပြင်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြိုက်မရှက်....ငိုက်မရှက်...ငတ်မရှက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကြိုးကြာဆို....ဘာငှက်လဲမေး",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကံကောင်းရင် တစ်ချက်....ကံမကောင်းရင် တစ်သက်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကံသည် အလုပ်....အလုပ်သည် ကံ",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကုန်းပေါ်ရောက်မှ....ရေမမွန်းစေနှင့်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "ကိစ္စများမြောင်....လူတို့ဘောင်",
    "long": "",
    "creator": "ဗမာ"
  },
  {
    "short": "",
    "long": "",
    "creator": "ဗမာ"
  }
]

menu.forEach(function (obj) {
  db.collection("proberbs").add({
    short: obj.short,
    long: obj.long,
    creator: obj.creator
  }).then(function (docRef) {
    console.log("Document written with ID: ", docRef.id);
  })
    .catch(function (error) {
      console.error("Error adding document: ", error);
    });
});
